// FILE: src/facilities.js
import { BUILDINGS } from "./buildings";

// 편의시설 좌표 (카테고리 → 이름 → 좌표)
export const FACILITIES = {
  식당: {
    "학식(18관)": { ...BUILDINGS["장준하통일관"] },
    "학식(임마누엘관)": { ...BUILDINGS["임마누엘관(학생회관)"] },
  },
  카페: {
    "카페ing(18관)": { ...BUILDINGS["장준하통일관"] },
    "카페ing(경삼관)": { ...BUILDINGS["경삼관(도서관)"] },
    베라티스: { ...BUILDINGS["새롬터"] },
    스테이: { lat: 37.194896818960764, lng: 127.02304188449692 },
  },
  편의점: {
    CU: { ...BUILDINGS["장준하통일관"] },
    emart24: { ...BUILDINGS["임마누엘관(학생회관)"] },
    "Seven-Eleven": { lat: 37.194848017961405, lng: 127.01875055731252 },
  },
  주차장: {
    주차장1: { lat: 37.19222861381026, lng: 127.02808685191674 },
    주차장2: { lat: 37.19384539517173, lng: 127.01998362299412 },
    주차장3: { lat: 37.19295, lng: 127.0276 },
    주차장4: { lat: 37.19315, lng: 127.0226 },
    주차장5: { lat: 37.1941, lng: 127.023 },
    주차장6: { lat: 37.19462492657767, lng: 127.01925453275518 },
    주차장7: { lat: 37.194244247319396, lng: 127.01915869890733 },
    주차장8: { lat: 37.195140831412836, lng: 127.01893084301445 },
    주차장9: { lat: 37.193963904041915, lng: 127.02465786382504 },
  },
  "은행/ATM": {
    "은행/ATM": { lat: 37.19415, lng: 127.02222 },
  },
  우체국: {
    우체국: { ...BUILDINGS["해오름관"] },
  },
  "병원/약국": {
    "병원/약국": { lat: 37.19637447278284, lng: 127.0234112136435 },
  },
  "서점/문구": {
    "서점/문구": { lat: 37.1935, lng: 127.0242 },
  },
};
